burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_gpio.h
/* AFIO_EXTISS2 */
#define AFIO_EXTI8_SS                    BITS(0,3)           /*!< EXTI 8 sources selection */
#define AFIO_EXTI9_SS                    BITS(4,7)           /*!< EXTI 9 sources selection */
#define AFIO_EXTI10_SS                   BITS(8,11)          /*!< EXTI 10 sources selection */
#define AFIO_EXTI11_SS                   BITS(12,15)         /*!< EXTI 11 sources selection */

/* AFIO_EXTISS3 */
#define AFIO_EXTI12_SS                   BITS(0,3)           /*!< EXTI 12 sources selection */
#define AFIO_EXTI13_SS                   BITS(4,7)           /*!< EXTI 13 sources selection */
#define AFIO_EXTI14_SS                   BITS(8,11)          /*!< EXTI 14 sources selection */
#define AFIO_EXTI15_SS                   BITS(12,15)         /*!< EXTI 15 sources selection */

/* AFIO_PCF1 */
#define AFIO_PCF1_TIMER8_REMAP           BIT(5)              /*!< TIMER8 remapping */
#define AFIO_PCF1_TIMER9_REMAP           BIT(6)              /*!< TIMER9 remapping */
#define AFIO_PCF1_TIMER10_REMAP          BIT(7)              /*!< TIMER10 remapping */
#define AFIO_PCF1_TIMER12_REMAP          BIT(8)              /*!< TIMER12 remapping */
#define AFIO_PCF1_TIMER13_REMAP          BIT(9)              /*!< TIMER13 remapping */
#define AFIO_PCF1_EXMC_NADV              BIT(10)             /*!< EXMC_NADV connect/disconnect */
#define AFIO_PCF1_CTC_REMAP              BITS(11,12)         /*!< CTC remapping */

/* AFIO_CPSCTL */
#define AFIO_CPSCTL_CPS_EN               BIT(0)              /*!< I/O compensation cell enable */
#define AFIO_CPSCTL_CPS_RDY              BIT(8)              /*!< I/O compensation cell is ready or not */

/* AFIO_PCFA */
#define AFIO_PCFA_PA1_AFCFG              BIT(1)              /*!< PA1 AF function configuration bit */      
#define AFIO_PCFA_PA2_AFCFG              BIT(4)              /*!< PA2 AF function configuration bit */
#define AFIO_PCFA_PA3_AFCFG              BIT(6)              /*!< PA3 AF function configuration bit */
#define AFIO_PCFA_PA5_AFCFG              BIT(10)             /*!< PA5 AF function configuration bit */
#define AFIO_PCFA_PA6_AFCFG              BIT(14)             /*!< PA6 AF function configuration bit */
#define AFIO_PCFA_PA7_AFCFG              BIT(15)             /*!< PA7 AF function configuration bit */
#define AFIO_PCFA_PA8_AFCFG              BITS(16, 17)        /*!< PA8 AF function configuration bits */
#define AFIO_PCFA_PA9_AFCFG              BITS(18, 19)        /*!< PA9 AF function configuration bits */
#define AFIO_PCFA_PA10_AFCFG             BITS(20, 21)        /*!< PA10 AF function configuration bits */
#define AFIO_PCFA_PA11_AFCFG             BITS(22, 23)        /*!< PA11 AF function configuration bits */
#define AFIO_PCFA_PA12_AFCFG             BITS(24, 25)        /*!< PA12 AF function configuration bits */
#define AFIO_PCFA_PA13_AFCFG             BIT(27)             /*!< PA13 AF function configuration bits */
#define AFIO_PCFA_PA9_AFCFG_ADDITION     BIT(28)             /*!< PA9 AF function addition configuration bits */
#define AFIO_PCFA_PA10_AFCFG_ADDITION    BIT(29)             /*!< PA10 AF function addition configuration bits */
#define AFIO_PCFA_PA15_AFCFG             BIT(30)             /*!< PA15 AF function configuration bit */

/* AFIO_PCFB */
#define AFIO_PCFB_PB0_AFCFG              BIT(0)              /*!< PB0 AF function configuration bit */
#define AFIO_PCFB_PB5_AFCFG_ADDITION     BIT(1)              /*!< PB1 AF function addition configuration bit */
#define AFIO_PCFB_PB1_AFCFG              BITS(2, 3)          /*!< PB1 AF function configuration bits */
#define AFIO_PCFB_PB2_AFCFG              BITS(4, 5)          /*!< PB2 AF function configuration bits */
#define AFIO_PCFB_PB3_AFCFG              BIT(6)              /*!< PB3 AF function configuration bit */
#define AFIO_PCFB_PB4_AFCFG              BITS(8, 9)          /*!< PB4 AF function configuration bits */
#define AFIO_PCFB_PB5_AFCFG              BITS(10, 11)        /*!< PB5 AF function configuration bits */
#define AFIO_PCFB_PB6_AFCFG              BIT(12)             /*!< PB6 AF function configuration bit */
#define AFIO_PCFB_PB7_AFCFG              BIT(14)             /*!< PB7 AF function configuration bit */
#define AFIO_PCFB_PB8_AFCFG              BITS(16, 17)        /*!< PB8 AF function configuration bits */
#define AFIO_PCFB_PB9_AFCFG              BITS(18, 19)        /*!< PB9 AF function configuration bits */
#define AFIO_PCFB_PB10_AFCFG             BITS(20, 21)        /*!< PB10 AF function configuration bits */
#define AFIO_PCFB_PB11_AFCFG             BITS(22, 23)        /*!< PB11 AF function configuration bits */
#define AFIO_PCFB_PB12_AFCFG             BITS(24, 25)        /*!< PB12 AF function configuration bits */
#define AFIO_PCFB_PB13_AFCFG             BITS(26, 27)        /*!< PB13 AF function configuration bits */
#define AFIO_PCFB_PB14_AFCFG             BITS(28, 29)        /*!< PB14 AF function configuration bits */
#define AFIO_PCFB_PB15_AFCFG             BIT(30)             /*!< PB15 AF function configuration bits */

/* AFIO_PCFC */
#define AFIO_PCFC_PC0_AFCFG              BIT(0)              /*!< PC0 AF function configuration bit */
#define AFIO_PCFC_PC2_AFCFG              BITS(4, 5)          /*!< PC2 AF function configuration bits */
#define AFIO_PCFC_PC3_AFCFG              BIT(6)              /*!< PC3 AF function configuration bit */
#define AFIO_PCFC_PC5_AFCFG              BIT(11)             /*!< PC5 AF function configuration bit */
#define AFIO_PCFC_PC6_AFCFG              BITS(12, 13)        /*!< PC6 AF function configuration bits */
#define AFIO_PCFC_PC7_AFCFG              BITS(14, 15)        /*!< PC7 AF function configuration bits */
#define AFIO_PCFC_PC8_AFCFG              BITS(16, 17)        /*!< PC8 AF function configuration bits */
#define AFIO_PCFC_PC9_AFCFG              BITS(18, 19)        /*!< PC9 AF function configuration bits */
#define AFIO_PCFC_PC10_AFCFG             BIT(20)             /*!< PC10 AF function configuration bit */
#define AFIO_PCFC_PC11_AFCFG             BITS(22, 23)        /*!< PC11 AF function configuration bits */
#define AFIO_PCFC_PC12_AFCFG             BIT(24)             /*!< PC12 AF function configuration bit */

