burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_gpio.h
/* GPIO output pin source definitions */
#define GPIO_PIN_SOURCE_0                ((uint8_t)0x00U)          /*!< GPIO pin source 0 */
#define GPIO_PIN_SOURCE_1                ((uint8_t)0x01U)          /*!< GPIO pin source 1 */
#define GPIO_PIN_SOURCE_2                ((uint8_t)0x02U)          /*!< GPIO pin source 2 */
#define GPIO_PIN_SOURCE_3                ((uint8_t)0x03U)          /*!< GPIO pin source 3 */
#define GPIO_PIN_SOURCE_4                ((uint8_t)0x04U)          /*!< GPIO pin source 4 */
#define GPIO_PIN_SOURCE_5                ((uint8_t)0x05U)          /*!< GPIO pin source 5 */
#define GPIO_PIN_SOURCE_6                ((uint8_t)0x06U)          /*!< GPIO pin source 6 */
#define GPIO_PIN_SOURCE_7                ((uint8_t)0x07U)          /*!< GPIO pin source 7 */
#define GPIO_PIN_SOURCE_8                ((uint8_t)0x08U)          /*!< GPIO pin source 8 */
#define GPIO_PIN_SOURCE_9                ((uint8_t)0x09U)          /*!< GPIO pin source 9 */
#define GPIO_PIN_SOURCE_10               ((uint8_t)0x0AU)          /*!< GPIO pin source 10 */
#define GPIO_PIN_SOURCE_11               ((uint8_t)0x0BU)          /*!< GPIO pin source 11 */
#define GPIO_PIN_SOURCE_12               ((uint8_t)0x0CU)          /*!< GPIO pin source 12 */
#define GPIO_PIN_SOURCE_13               ((uint8_t)0x0DU)          /*!< GPIO pin source 13 */
#define GPIO_PIN_SOURCE_14               ((uint8_t)0x0EU)          /*!< GPIO pin source 14 */
#define GPIO_PIN_SOURCE_15               ((uint8_t)0x0FU)          /*!< GPIO pin source 15 */

/* GPIO pin definitions */
#define GPIO_PIN_0                       BIT(0)                    /*!< GPIO pin 0 */
#define GPIO_PIN_1                       BIT(1)                    /*!< GPIO pin 1 */
#define GPIO_PIN_2                       BIT(2)                    /*!< GPIO pin 2 */
#define GPIO_PIN_3                       BIT(3)                    /*!< GPIO pin 3 */
#define GPIO_PIN_4                       BIT(4)                    /*!< GPIO pin 4 */
#define GPIO_PIN_5                       BIT(5)                    /*!< GPIO pin 5 */
#define GPIO_PIN_6                       BIT(6)                    /*!< GPIO pin 6 */
#define GPIO_PIN_7                       BIT(7)                    /*!< GPIO pin 7 */
#define GPIO_PIN_8                       BIT(8)                    /*!< GPIO pin 8 */
#define GPIO_PIN_9                       BIT(9)                    /*!< GPIO pin 9 */
#define GPIO_PIN_10                      BIT(10)                   /*!< GPIO pin 10 */
#define GPIO_PIN_11                      BIT(11)                   /*!< GPIO pin 11 */
#define GPIO_PIN_12                      BIT(12)                   /*!< GPIO pin 12 */
#define GPIO_PIN_13                      BIT(13)                   /*!< GPIO pin 13 */
#define GPIO_PIN_14                      BIT(14)                   /*!< GPIO pin 14 */
#define GPIO_PIN_15                      BIT(15)                   /*!< GPIO pin 15 */
#define GPIO_PIN_ALL                     BITS(0,15)                /*!< GPIO pin all */

/* AFIO remap mask */
#define PCF0_USART2_REMAP(regval)       (BITS(4,5) & ((uint32_t)(regval) << 4))                           /*!< USART2 remapping */        
#define PCF0_TIMER0_REMAP(regval)       (BITS(6,7) & ((uint32_t)(regval) << 6))                           /*!< TIMER0 remapping */
#define PCF0_TIMER1_REMAP(regval)       (BITS(8,9) & ((uint32_t)(regval) << 8))                           /*!< TIMER1 remapping */
#define PCF0_TIMER2_REMAP(regval)       (BITS(10,11) & ((uint32_t)(regval) << 10))                        /*!< TIMER2 remapping */
#define PCF0_CAN0_REMAP(regval)         (BITS(13,14) & ((uint32_t)(regval) << 13))                        /*!< CAN0 remapping */
#define PCF0_SWJ_CFG(regval)            (BITS(24,26) & ((uint32_t)(regval) << 24))                        /*!< serial wire JTAG configuration */
#define PCF1_CTC_REMAP(regval)          (BITS(11,12) & ((uint32_t)(regval) << 11))                        /*!< CTC remapping */

/* GPIO remap definitions */
#define GPIO_SPI0_REMAP                  AFIO_PCF0_SPI0_REMAP                                             /*!< SPI0 remapping */
#define GPIO_I2C0_REMAP                  AFIO_PCF0_I2C0_REMAP                                             /*!< I2C0 remapping */
#define GPIO_USART0_REMAP                AFIO_PCF0_USART0_REMAP                                           /*!< USART0 remapping */
#define GPIO_USART1_REMAP                AFIO_PCF0_USART1_REMAP                                           /*!< USART1 remapping */
#define GPIO_USART2_PARTIAL_REMAP        ((uint32_t)0x00140000U | PCF0_USART2_REMAP(1))                   /*!< USART2 partial remapping */
#define GPIO_USART2_FULL_REMAP           ((uint32_t)0x00140000U | PCF0_USART2_REMAP(3))                   /*!< USART2 full remapping */
#define GPIO_TIMER0_PARTIAL_REMAP        ((uint32_t)0x00160000U | PCF0_TIMER0_REMAP(1))                   /*!< TIMER0 partial remapping */
#define GPIO_TIMER0_FULL_REMAP           ((uint32_t)0x00160000U | PCF0_TIMER0_REMAP(3))                   /*!< TIMER0 full remapping */
#define GPIO_TIMER1_PARTIAL_REMAP0       ((uint32_t)0x00180000U | PCF0_TIMER1_REMAP(1))                   /*!< TIMER1 partial remapping */
#define GPIO_TIMER1_PARTIAL_REMAP1       ((uint32_t)0x00180000U | PCF0_TIMER1_REMAP(2))                   /*!< TIMER1 partial remapping */
#define GPIO_TIMER1_FULL_REMAP           ((uint32_t)0x00180000U | PCF0_TIMER1_REMAP(3))                   /*!< TIMER1 full remapping */
#define GPIO_TIMER2_PARTIAL_REMAP        ((uint32_t)0x001A0000U | PCF0_TIMER2_REMAP(2))                   /*!< TIMER2 partial remapping */
#define GPIO_TIMER2_FULL_REMAP           ((uint32_t)0x001A0000U | PCF0_TIMER2_REMAP(3))                   /*!< TIMER2 full remapping */
#define GPIO_TIMER3_REMAP                AFIO_PCF0_TIMER3_REMAP                                           /*!< TIMER3 remapping */
#define GPIO_CAN0_PARTIAL_REMAP          ((uint32_t)0x001D0000U | PCF0_CAN0_REMAP(2))                     /*!< CAN0 partial remapping */
#define GPIO_CAN0_FULL_REMAP             ((uint32_t)0x001D0000U | PCF0_CAN0_REMAP(3))                     /*!< CAN0 full remapping */
#define GPIO_PD01_REMAP                  AFIO_PCF0_PD01_REMAP                                             /*!< PD01 remapping */
#define GPIO_TIMER4CH3_IREMAP            ((uint32_t)0x00200000U | (AFIO_PCF0_TIMER4CH3_IREMAP >> 16))     /*!< TIMER4 channel3 internal remapping */
#if defined(GD32E51X_HD)
#define GPIO_ADC0_ETRGRT_REMAP          ((uint32_t)0x00200000U | (AFIO_PCF0_ADC0_ETRGRT_REMAP >> 16))   /*!< ADC0 external trigger routine conversion remapping(only for GD32E51X_HD devices) */
#define GPIO_ADC1_ETRGRT_REMAP          ((uint32_t)0x00200000U | (AFIO_PCF0_ADC1_ETRGRT_REMAP >> 16))   /*!< ADC1 external trigger routine conversion remapping(only for GD32E51X_HD devices) */
#endif /* GD32E51X_HD*/
#if defined(GD32E51X_CL) || defined(GD32E518) 
#define GPIO_ENET_REMAP                  ((uint32_t)0x00200000U | (AFIO_PCF0_ENET_REMAP >> 16))           /*!< ENET remapping(only for GD32E517, GD32E518 devices) */
#endif /* GD32E51X_CL||GD32E518 */
#define GPIO_CAN1_REMAP                  ((uint32_t)0x00200000U | (AFIO_PCF0_CAN1_REMAP >> 16))           /*!< CAN1 remapping(only for GD32E51X_CL devices) */
#define GPIO_SWJ_NONJTRST_REMAP          ((uint32_t)0x00300000U | (PCF0_SWJ_CFG(1) >> 16))                /*!< full SWJ(JTAG-DP + SW-DP),but without NJTRST */
#define GPIO_SWJ_SWDPENABLE_REMAP        ((uint32_t)0x00300000U | (PCF0_SWJ_CFG(2) >> 16))                /*!< JTAG-DP disabled and SW-DP enabled */
#define GPIO_SWJ_DISABLE_REMAP           ((uint32_t)0x00300000U | (PCF0_SWJ_CFG(4) >> 16))                /*!< JTAG-DP disabled and SW-DP disabled */
#define GPIO_SPI2_REMAP                  ((uint32_t)0x00200000U | (AFIO_PCF0_SPI2_REMAP >> 16))           /*!< SPI2 remapping*/
#if defined(GD32E51X_CL) || defined(GD32E518)
#define GPIO_TIMER1ITR1_REMAP            ((uint32_t)0x00200000U | (AFIO_PCF0_TIMER1ITR1_REMAP >> 16))     /*!< TIMER1 internal trigger 1 remapping(only for GD32E517, GD32E518 devices) */
#define GPIO_PTP_PPS_REMAP               ((uint32_t)0x00200000U | (AFIO_PCF0_PTP_PPS_REMAP >> 16))        /*!< ethernet PTP PPS remapping(only for GD32E517, GD32E518 devices) */
#endif /* GD32E51X_CL||GD32E518 */
#define GPIO_TIMER8_REMAP                ((uint32_t)0x80000000U | AFIO_PCF1_TIMER8_REMAP)                 /*!< TIMER8 remapping */
#define GPIO_TIMER9_REMAP                ((uint32_t)0x80000000U | AFIO_PCF1_TIMER9_REMAP)                 /*!< TIMER9 remapping */
#define GPIO_TIMER10_REMAP               ((uint32_t)0x80000000U | AFIO_PCF1_TIMER10_REMAP)                /*!< TIMER10 remapping */
#define GPIO_TIMER12_REMAP               ((uint32_t)0x80000000U | AFIO_PCF1_TIMER12_REMAP)                /*!< TIMER12 remapping */
#define GPIO_TIMER13_REMAP               ((uint32_t)0x80000000U | AFIO_PCF1_TIMER13_REMAP)                /*!< TIMER13 remapping */
#define GPIO_EXMC_NADV_REMAP             ((uint32_t)0x80000000U | AFIO_PCF1_EXMC_NADV)                    /*!< EXMC_NADV connect/disconnect */
#define GPIO_CTC_REMAP0                  ((uint32_t)0x801B0000U | PCF1_CTC_REMAP(1))                      /*!< CTC remapping(PD15) */
#define GPIO_CTC_REMAP1                  ((uint32_t)0x801B0000U | PCF1_CTC_REMAP(2))                      /*!< CTC remapping(PF0) */

/* AFIO_PCFA AFCFG mask */
#define PCFA_PA2_AFCFG(regval)            (BITS(4, 5) & ((uint32_t)(regval) << 4))                         /*!< PA2 AFCFG */
#define PCFA_PA3_AFCFG(regval)            (BITS(6, 7) & ((uint32_t)(regval) << 6))                         /*!< PA3 AFCFG */
#define PCFA_PA8_AFCFG(regval)            (BITS(16, 17) & ((uint32_t)(regval) << 16))                      /*!< PA8 AFCFG */
#define PCFA_PA9_AFCFG(regval)            (BITS(18, 19) & ((uint32_t)(regval) << 18))                      /*!< PA9 AFCFG */
#define PCFA_PA10_AFCFG(regval)           (BITS(20, 21) & ((uint32_t)(regval) << 20))                      /*!< PA10 AFCFG */
#define PCFA_PA11_AFCFG(regval)           (BITS(22, 23) & ((uint32_t)(regval) << 22))                      /*!< PA11 AFCFG */
#define PCFA_PA12_AFCFG(regval)           (BITS(24, 26) & ((uint32_t)(regval) << 24))                      /*!< PA12 AFCFG */

/* AFIO_PCFB AFCFG mask */
#define PCFB_PB1_AFCFG(regval)            (BITS(2, 3) & ((uint32_t)(regval) << 2))                         /*!< PB1 AFCFG */
#define PCFB_PB2_AFCFG(regval)            (BITS(4, 5) & ((uint32_t)(regval) << 4))                         /*!< PB2 AFCFG */
#define PCFB_PB4_AFCFG(regval)            (BITS(7, 9) & ((uint32_t)(regval) << 7))                         /*!< PB4 AFCFG */
#define PCFB_PB5_AFCFG(regval)            (BITS(10, 11) & ((uint32_t)(regval) << 10))                      /*!< PB5 AFCFG */
#define PCFB_PB6_AFCFG(regval)            (BITS(12, 13) & ((uint32_t)(regval) << 12))                      /*!< PB6 AFCFG */
#define PCFB_PB7_AFCFG(regval)            (BITS(14, 15) & ((uint32_t)(regval) << 14))                      /*!< PB7 AFCFG */
#define PCFB_PB8_AFCFG(regval)            (BITS(16, 17) & ((uint32_t)(regval) << 16))                      /*!< PB8 AFCFG */
#define PCFB_PB9_AFCFG(regval)            (BITS(18, 19) & ((uint32_t)(regval) << 18))                      /*!< PB9 AFCFG */
#define PCFB_PB10_AFCFG(regval)           (BITS(20, 21) & ((uint32_t)(regval) << 20))                      /*!< PB10 AFCFG */
#define PCFB_PB11_AFCFG(regval)           (BITS(22, 23) & ((uint32_t)(regval) << 22))                      /*!< PB11 AFCFG */
#define PCFB_PB12_AFCFG(regval)           (BITS(24, 25) & ((uint32_t)(regval) << 24))                      /*!< PB12 AFCFG */
#define PCFB_PB13_AFCFG(regval)           (BITS(26, 27) & ((uint32_t)(regval) << 26))                      /*!< PB13 AFCFG */
#define PCFB_PB14_AFCFG(regval)           (BITS(28, 29) & ((uint32_t)(regval) << 28))                      /*!< PB14 AFCFG */
#define PCFB_PB15_AFCFG(regval)           (BITS(30, 31) & ((uint32_t)(regval) << 30))                      /*!< PB15 AFCFG */

/* AFIO_PCFC AFCFG mask */
#define PCFC_PC2_AFCFG(regval)            (BITS(4, 5) & ((uint32_t)(regval) << 4))                         /*!< PC2 AFCFG */
#define PCFC_PC6_AFCFG(regval)            (BITS(12, 13) & ((uint32_t)(regval) << 12))                      /*!< PC6 AFCFG */
#define PCFC_PC7_AFCFG(regval)            (BITS(14, 15) & ((uint32_t)(regval) << 14))                      /*!< PC7 AFCFG */
#define PCFC_PC8_AFCFG(regval)            (BITS(16, 17) & ((uint32_t)(regval) << 16))                      /*!< PC8 AFCFG */
#define PCFC_PC9_AFCFG(regval)            (BITS(18, 19) & ((uint32_t)(regval) << 18))                      /*!< PC9 AFCFG */
#define PCFC_PC11_AFCFG(regval)           (BITS(22, 23) & ((uint32_t)(regval) << 22))                      /*!< PC11 AFCFG */

/* AFIO_PCFE AFCFG mask */
#define PCFE_PE0_AFCFG(regval)            (BITS(0, 1) & ((uint32_t)(regval)))                              /*!< PE0 AFCFG */
#define PCFE_PE1_AFCFG(regval)            (BITS(2, 3) & ((uint32_t)(regval) << 2))                         /*!< PE1 AFCFG */

