burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_gpio.h
/* AFIO_PCFG AFCFG mask */
#define PCFG_PG7_AFCFG(regval)            (BITS(14, 15) & ((uint32_t)(regval) << 14))                      /*!< PG7 AFCFG */

/* GPIOA AF function definitions */
#define AFIO_PA1_TIMER14_CFG              AFIO_PCFA_PA1_AFCFG                                              /*!< configure PA1 alternate function to TIMER14 */
#define AFIO_PA2_CMP1_CFG                 ((uint32_t)0x00140000U | PCFA_PA2_AFCFG(1))                      /*!< configure PA2 alternate function to CMP1 */
#define AFIO_PA2_TIMER14_CFG              ((uint32_t)0x00140000U | PCFA_PA2_AFCFG(2))                      /*!< configure PA2 alternate function to TIMER14 */
#define AFIO_PA3_USBHS_CFG                ((uint32_t)0x00160000U | PCFA_PA3_AFCFG(1))                      /*!< configure PA3 alternate function to USBHS */
#define AFIO_PA3_TIMER14_CFG              ((uint32_t)0x00160000U | PCFA_PA3_AFCFG(2))                      /*!< configure PA3 alternate function to TIMER14 */
#define AFIO_PA5_USBHS_CFG                AFIO_PCFA_PA5_AFCFG                                              /*!< configure PA5 alternate function to USBHS */
#define AFIO_PA6_TIMER15_CFG              AFIO_PCFA_PA6_AFCFG                                              /*!< configure PA6 alternate function to TIMER15 */
#define AFIO_PA7_TIMER16_CFG              AFIO_PCFA_PA7_AFCFG                                              /*!< configure PA6 alternate function to TIMER16 */
#define AFIO_PA8_I2C2_CFG                 ((uint32_t)0x00300000U | (PCFA_PA8_AFCFG(1) >> 16))              /*!< configure PA8 alternate function to I2C2 */
#define AFIO_PA8_SHRTIMER_CFG             ((uint32_t)0x00300000U | (PCFA_PA8_AFCFG(2) >> 16))              /*!< configure PA8 alternate function to SHRTIMER */
#define AFIO_PA9_CAN2_CFG                 ((uint32_t)0x00320000U | (PCFA_PA9_AFCFG(1) >> 16))              /*!< configure PA9 alternate function to CAN2 */
#define AFIO_PA9_I2C2_CFG                 ((uint32_t)0x00320000U | (PCFA_PA9_AFCFG(2) >> 16))              /*!< configure PA9 alternate function to I2C2 */
#define AFIO_PA9_SHRTIMER_CFG             ((uint32_t)0x00320000U | (PCFA_PA9_AFCFG(3) >> 16))              /*!< configure PA9 alternate function to SHRTIMER */
#define AFIO_PA9_TIMER14_CFG              ((uint32_t)0x00200000U | (AFIO_PCFA_PA9_AFCFG_ADDITION >> 16))   /*!< configure PA9 alternate function to TIMER14 */              
#define AFIO_PA10_CAN2_CFG                ((uint32_t)0x00340000U | (PCFA_PA10_AFCFG(1) >> 16))             /*!< configure PA10 alternate function to CAN2 */
#define AFIO_PA10_CMP5_CFG                ((uint32_t)0x00340000U | (PCFA_PA10_AFCFG(2) >> 16))             /*!< configure PA10 alternate function to CMP5 */
#define AFIO_PA10_SHRTIMER_CFG            ((uint32_t)0x00340000U | (PCFA_PA10_AFCFG(3) >> 16))             /*!< configure PA10 alternate function to SHRTIMER */
#define AFIO_PA10_TIMER16_CFG             ((uint32_t)0x00200000U | (AFIO_PCFA_PA10_AFCFG_ADDITION >> 16))  /*!< configure PA10 alternate function to TIMER16 */              
#define AFIO_PA11_USART5_CFG              ((uint32_t)0x00360000U | (PCFA_PA11_AFCFG(1) >> 16))             /*!< configure PA11 alternate function to USART5 */
#define AFIO_PA11_SHRTIMER_CFG            ((uint32_t)0x00360000U | (PCFA_PA11_AFCFG(2) >> 16))             /*!< configure PA11 alternate function to SHRTIMER */
#define AFIO_PA12_CMP1_CFG                ((uint32_t)0x00380000U | (PCFA_PA12_AFCFG(1) >> 16))             /*!< configure PA12 alternate function to CMP1 */
#define AFIO_PA12_USART5_CFG              ((uint32_t)0x00380000U | (PCFA_PA12_AFCFG(2) >> 16))             /*!< configure PA12 alternate function to USART5 */
#define AFIO_PA12_SHRTIMER_CFG            ((uint32_t)0x00380000U | (PCFA_PA12_AFCFG(3) >> 16))             /*!< configure PA12 alternate function to SHRTIMER */
#define AFIO_PA12_TIMER15_CFG             ((uint32_t)0x00380000U | (PCFA_PA12_AFCFG(4) >> 16))             /*!< configure PA12 alternate function to TIMER15 */
#define AFIO_PA13_TIMER15_CFG             ((uint32_t)0x00200000U | AFIO_PCFA_PA13_AFCFG >> 16)             /*!< configure PA12 alternate function to TIMER15 */
#define AFIO_PA15_SHRTIMER_CFG            ((uint32_t)0x00200000U | AFIO_PCFA_PA15_AFCFG >> 16)             /*!< configure PA15 alternate function to SHRTIMER */

/* GPIOB AF function definitions */
#define AFIO_PB0_USBHS_CFG                ((uint32_t)0x01000000U | AFIO_PCFB_PB0_AFCFG)                     /*!< configure PB0 alternate function to USBHS */
#define AFIO_PB1_CMP3_CFG                 ((uint32_t)0x01120000U | PCFB_PB1_AFCFG(1))                       /*!< configure PB1 alternate function to CMP3 */
#define AFIO_PB1_USBHS_CFG                ((uint32_t)0x01120000U | PCFB_PB1_AFCFG(2))                       /*!< configure PB1 alternate function to USBHS */
#define AFIO_PB1_SHRTIMER_CFG             ((uint32_t)0x01120000U | PCFB_PB1_AFCFG(3))                       /*!< configure PB1 alternate function to SHRTIMER */
#define AFIO_PB2_USBHS_CFG                ((uint32_t)0x01140000U | PCFB_PB2_AFCFG(2))                       /*!< configure PB2 alternate function to USBHS */
#define AFIO_PB2_SHRTIMER_CFG             ((uint32_t)0x01140000U | PCFB_PB2_AFCFG(1))                       /*!< configure PB2 alternate function to SHRTIMER */
#define AFIO_PB3_SHRTIMER_CFG             ((uint32_t)0x01000000U | AFIO_PCFB_PB3_AFCFG)                     /*!< configure PB3 alternate function to SHRTIMER */
#define AFIO_PB4_TIMER15_CFG              ((uint32_t)0x01170000U | PCFB_PB4_AFCFG(1))                       /*!< configure PB4 alternate function to TIMER15 */
#define AFIO_PB4_I2S2_CFG                 ((uint32_t)0x01170000U | PCFB_PB4_AFCFG(2))                       /*!< configure PB4 alternate function to I2S2 */
#define AFIO_PB4_TIMER16_CFG              ((uint32_t)0x01170000U | PCFB_PB4_AFCFG(3))                       /*!< configure PB4 alternate function to TIMER16 */
#define AFIO_PB4_I2C2_CFG                 ((uint32_t)0x01170000U | PCFB_PB4_AFCFG(4))                       /*!< configure PB4 alternate function to I2C2 */
#define AFIO_PB4_SHRTIMER_CFG             ((uint32_t)0x01170000U | PCFB_PB4_AFCFG(6))                       /*!< configure PB4 alternate function to SHRTIMER */
#define AFIO_PB5_TIMER15_CFG              ((uint32_t)0x01000000U | AFIO_PCFB_PB5_AFCFG_ADDITION)            /*!< configure PB5 alternate function to TIEMR15 */  
#define AFIO_PB5_I2C2_CFG                 ((uint32_t)0x011A0000U | PCFB_PB5_AFCFG(1))                       /*!< configure PB5 alternate function to I2C2 */
#define AFIO_PB5_TIMER16_CFG              ((uint32_t)0x011A0000U | PCFB_PB5_AFCFG(1))| AFIO_PB5_TIMER15_CFG /*!< configure PB5 alternate function to TIMER16 */
#define AFIO_PB5_USBHS_CFG                ((uint32_t)0x011A0000U | PCFB_PB5_AFCFG(2))                       /*!< configure PB5 alternate function to USBHS */
#define AFIO_PB5_SHRTIMER_CFG             ((uint32_t)0x011A0000U | PCFB_PB5_AFCFG(3))                       /*!< configure PB5 alternate function to SHRTIMER */
#define AFIO_PB6_SHRTIMER_CFG             ((uint32_t)0x011C0000U | PCFB_PB6_AFCFG(1))                       /*!< configure PB6 alternate function to SHRTIMER */
#define AFIO_PB6_TIMER15_CFG              ((uint32_t)0x011C0000U | PCFB_PB6_AFCFG(2))                       /*!< configure PB6 alternate function to TIMER15 */
#define AFIO_PB7_SHRTIMER_CFG             ((uint32_t)0x011E0000U | PCFB_PB7_AFCFG(1))                       /*!< configure PB7 alternate function to SHRTIMER */
#define AFIO_PB7_TIMER16_CFG              ((uint32_t)0x011E0000U | PCFB_PB7_AFCFG(2))                       /*!< configure PB7 alternate function to TIMER16 */
#define AFIO_PB8_I2C2_CFG                 ((uint32_t)0x01300000U | (PCFB_PB8_AFCFG(1) >> 16))               /*!< configure PB8 alternate function to I2C2 */
#define AFIO_PB8_SHRTIMER_CFG             ((uint32_t)0x01300000U | (PCFB_PB8_AFCFG(2) >> 16))               /*!< configure PB8 alternate function to SHRTIMER */
#define AFIO_PB8_TIMER15_CFG              ((uint32_t)0x01300000U | (PCFB_PB8_AFCFG(3) >> 16))               /*!< configure PB8 alternate function to TIMER15 */
#define AFIO_PB9_CMP1_CFG                 ((uint32_t)0x01320000U | (PCFB_PB9_AFCFG(1) >> 16))               /*!< configure PB9 alternate function to CMP1 */
#define AFIO_PB9_SHRTIMER_CFG             ((uint32_t)0x01320000U | (PCFB_PB9_AFCFG(2) >> 16))               /*!< configure PB9 alternate function to SHRTIMER */
#define AFIO_PB9_TIMER16_CFG              ((uint32_t)0x01320000U | (PCFB_PB9_AFCFG(3) >> 16))               /*!< configure PB9 alternate function to TIMER16 */
#define AFIO_PB10_CAN2_CFG                ((uint32_t)0x01340000U | (PCFB_PB10_AFCFG(1) >> 16))              /*!< configure PB10 alternate function to CAN2 */
#define AFIO_PB10_USBHS_CFG               ((uint32_t)0x01340000U | (PCFB_PB10_AFCFG(2) >> 16))              /*!< configure PB10 alternate function to USBHS */
#define AFIO_PB10_SHRTIMER_CFG            ((uint32_t)0x01340000U | (PCFB_PB10_AFCFG(3) >> 16))              /*!< configure PB10 alternate function to SHRTIMER */
#define AFIO_PB11_CAN2_CFG                ((uint32_t)0x01360000U | (PCFB_PB11_AFCFG(1) >> 16))              /*!< configure PB11 alternate function to CAN2 */
#define AFIO_PB11_USBHS_CFG               ((uint32_t)0x01360000U | (PCFB_PB11_AFCFG(2) >> 16))              /*!< configure PB11 alternate function to USBHS */
#define AFIO_PB11_SHRTIMER_CFG            ((uint32_t)0x01360000U | (PCFB_PB11_AFCFG(3) >> 16))              /*!< configure PB11 alternate function to SHRTIMER */
#define AFIO_PB12_SHRTIMER_CFG            ((uint32_t)0x01380000U | (PCFB_PB12_AFCFG(1) >> 16))              /*!< configure PB12 alternate function to SHRTIMER */
#define AFIO_PB12_USBHS_CFG               ((uint32_t)0x01380000U | (PCFB_PB12_AFCFG(2) >> 16))              /*!< configure PB12 alternate function to USBHS */
#define AFIO_PB13_SHRTIMER_CFG            ((uint32_t)0x013A0000U | (PCFB_PB13_AFCFG(1) >> 16))              /*!< configure PB13 alternate function to SHRTIMER */
#define AFIO_PB13_USBHS_CFG               ((uint32_t)0x013A0000U | (PCFB_PB13_AFCFG(2) >> 16))              /*!< configure PB13 alternate function to USBHS */
#define AFIO_PB14_I2S1_CFG                ((uint32_t)0x013C0000U | (PCFB_PB14_AFCFG(1) >> 16))              /*!< configure PB14 alternate function to I2S1 */
#define AFIO_PB14_SHRTIMER_CFG            ((uint32_t)0x013C0000U | (PCFB_PB14_AFCFG(2) >> 16))              /*!< configure PB14 alternate function to SHRTIMER */
#define AFIO_PB14_TIMER14_CH0_CFG         ((uint32_t)0x013C0000U | (PCFB_PB14_AFCFG(3) >> 16))              /*!< configure PB14 alternate function to TIMER14_CH0 */
#define AFIO_PB15_SHRTIMER_CFG            ((uint32_t)0x013E0000U | (PCFB_PB15_AFCFG(1) >> 16))              /*!< configure PB15 alternate function to SHRTIMER */
#define AFIO_PB15_TIMER14_CH1_CFG         ((uint32_t)0x013E0000U | (PCFB_PB15_AFCFG(2) >> 16))              /*!< configure PB15 alternate function to TIMER14_CH1 */
#define AFIO_PB15_TIMER14_CH0_ON_CFG      ((uint32_t)0x013E0000U | (PCFB_PB15_AFCFG(3) >> 16))              /*!< configure PB15 alternate function to TIMER14_CH0_ON */

/* GPIOC AF function definitions */
#define AFIO_PC0_USBHS_CFG                ((uint32_t)0x02000000U | AFIO_PCFC_PC0_AFCFG)                     /*!< configure PC0 alternate function to USBHS */
#define AFIO_PC2_I2S1_CFG                 ((uint32_t)0x02140000U | PCFC_PC2_AFCFG(1))                       /*!< configure PC2 alternate function to I2S1 */
#define AFIO_PC2_USBHS_CFG                ((uint32_t)0x02140000U | PCFC_PC2_AFCFG(2))                       /*!< configure PC2 alternate function to USBHS */
#define AFIO_PC3_USBHS_CFG                ((uint32_t)0x02000000U | AFIO_PCFC_PC3_AFCFG)                     /*!< configure PC3 alternate function to USBHS */
#define AFIO_PC5_TIMER14_CFG              ((uint32_t)0x02000000U | AFIO_PCFC_PC5_AFCFG)                     /*!< configure PC5 alternate function to TIMER14 */
#define AFIO_PC6_CMP5_CFG                 ((uint32_t)0x021C0000U | PCFC_PC6_AFCFG(1))                       /*!< configure PC6 alternate function to CMP5 */
#define AFIO_PC6_USART5_CFG               ((uint32_t)0x021C0000U | PCFC_PC6_AFCFG(2))                       /*!< configure PC6 alternate function to USART5 */
#define AFIO_PC6_SHRTIMER_CFG             ((uint32_t)0x021C0000U | PCFC_PC6_AFCFG(3))                       /*!< configure PC6 alternate function to SHRTIMER */
#define AFIO_PC7_USART5_CFG               ((uint32_t)0x021E0000U | PCFC_PC7_AFCFG(2))                       /*!< configure PC7 alternate function to USART5 */
#define AFIO_PC7_SHRTIMER_CFG             ((uint32_t)0x021E0000U | PCFC_PC7_AFCFG(1))                       /*!< configure PC7 alternate function to SHRTIMER */
#define AFIO_PC8_USART5_CFG               ((uint32_t)0x02300000U | (PCFC_PC8_AFCFG(2) >> 16))               /*!< configure PC8 alternate function to USART5 */
#define AFIO_PC8_SHRTIMER_CFG             ((uint32_t)0x02300000U | (PCFC_PC8_AFCFG(1) >> 16))               /*!< configure PC8 alternate function to SHRTIMER */
#define AFIO_PC9_I2C2_CFG                 ((uint32_t)0x02320000U | (PCFC_PC9_AFCFG(2) >> 16))               /*!< configure PC9 alternate function to I2C2 */
#define AFIO_PC9_SHRTIMER_CFG             ((uint32_t)0x02320000U | (PCFC_PC9_AFCFG(1) >> 16))               /*!< configure PC9 alternate function to SHRTIMER */
#define AFIO_PC10_I2C2_CFG                ((uint32_t)0x02200000U | (AFIO_PCFC_PC10_AFCFG >> 16))            /*!< configure PC10 alternate function to I2C2 */
#define AFIO_PC11_I2S2_CFG                ((uint32_t)0x02360000U | (PCFC_PC11_AFCFG(2) >> 16))              /*!< configure PC11 alternate function to I2S2 */
#define AFIO_PC11_SHRTIMER_CFG            ((uint32_t)0x02360000U | (PCFC_PC11_AFCFG(1) >> 16))              /*!< configure PC11 alternate function to SHRTIMER */
#define AFIO_PC12_SHRTIMER_CFG            ((uint32_t)0x02200000U | (AFIO_PCFC_PC12_AFCFG >> 16))            /*!< configure PC12 alternate function to SHRTIMER */

/* GPIOD AF function definitions */
#define AFIO_PD4_SHRTIMER_CFG             ((uint32_t)0x03000000U | AFIO_PCFD_PD4_AFCFG)                     /*!< configure PD4 alternate function to SHRTIMER */
#define AFIO_PD5_SHRTIMER_CFG             ((uint32_t)0x03000000U | AFIO_PCFD_PD5_AFCFG)                     /*!< configure PD5 alternate function to SHRTIMER */

/* GPIOE AF function definitions */
#define AFIO_PE0_CAN2_CFG                 ((uint32_t)0x04100000U | PCFE_PE0_AFCFG(1))                       /*!< configure PE0 alternate function to CAN2 */
#define AFIO_PE0_SHRTIMER_CFG             ((uint32_t)0x04100000U | PCFE_PE0_AFCFG(2))                       /*!< configure PE0 alternate function to SHRTIMER */
#define AFIO_PE1_CAN2_CFG                 ((uint32_t)0x04120000U | PCFE_PE1_AFCFG(1))                       /*!< configure PE1 alternate function to CAN2 */
#define AFIO_PE1_SHRTIMER_CFG             ((uint32_t)0x04120000U | PCFE_PE1_AFCFG(2))                       /*!< configure PE1 alternate function to SHRTIMER */
#define AFIO_PE8_CMP1_CFG                 ((uint32_t)0x04200000U | (AFIO_PCFE_PE8_AFCFG >> 16))             /*!< configure PE8 alternate function to CMP1 */
#define AFIO_PE9_CMP3_CFG                 ((uint32_t)0x04200000U | (AFIO_PCFE_PE9_AFCFG >> 16))             /*!< configure PE9 alternate function to CMP3 */
#define AFIO_PE10_CMP5_CFG                ((uint32_t)0x04200000U | (AFIO_PCFE_PE10_AFCFG >> 16))            /*!< configure PE10 alternate function to CMP5 */
#define AFIO_PE11_CMP5_CFG                ((uint32_t)0x04200000U | (AFIO_PCFE_PE11_AFCFG >> 16))            /*!< configure PE11 alternate function to CMP5 */
#define AFIO_PE12_CMP3_CFG                ((uint32_t)0x04200000U | (AFIO_PCFE_PE12_AFCFG >> 16))            /*!< configure PE12 alternate function to CMP3 */
#define AFIO_PE13_CMP1_CFG                ((uint32_t)0x04200000U | (AFIO_PCFE_PE13_AFCFG >> 16))            /*!< configure PE13 alternate function to CMP1 */

/* GPIOG AF function definitions */
#define AFIO_PG6_SHRTIMER_CFG             ((uint32_t)0x06000000U | AFIO_PCFG_PG6_AFCFG)                     /*!< configure PG6 alternate function to SHRTIMER_CFG */
#define AFIO_PG7_USART5_CFG               ((uint32_t)0x061E0000U | PCFG_PG7_AFCFG(1))                       /*!< configure PG7 alternate function to USART5 */
#define AFIO_PG7_SHRTIMER_CFG             ((uint32_t)0x061E0000U | PCFG_PG7_AFCFG(2))                       /*!< configure PG7 alternate function to SHRTIMER */
#define AFIO_PG9_USART5_CFG               ((uint32_t)0x06200000U | (AFIO_PCFG_PG9_AFCFG >> 16))             /*!< configure PG9 alternate function to USART5 */
#define AFIO_PG10_SHRTIMER_CFG            ((uint32_t)0x06200000U | (AFIO_PCFG_PG10_AFCFG >> 16))            /*!< configure PG10 alternate function to SHRTIMER */
#define AFIO_PG11_SHRTIMER_CFG            ((uint32_t)0x06200000U | (AFIO_PCFG_PG11_AFCFG >> 16))            /*!< configure PG11 alternate function to SHRTIMER */
#define AFIO_PG12_SHRTIMER_CFG            ((uint32_t)0x06200000U | (AFIO_PCFG_PG12_AFCFG >> 16))            /*!< configure PG12 alternate function to SHRTIMER */
#define AFIO_PG13_SHRTIMER_CFG            ((uint32_t)0x06200000U | (AFIO_PCFG_PG13_AFCFG >> 16))            /*!< configure PG13 alternate function to SHRTIMER */
#define AFIO_PG14_USART5_CFG              ((uint32_t)0x06200000U | (AFIO_PCFG_PG14_AFCFG >> 16))            /*!< configure PG14 alternate function to USART5 */

#if defined(GD32E51X_CL) || defined(GD32E518)
/* ethernet MII or RMII PHY selection */
#define GPIO_ENET_PHY_MII                ((uint32_t)0x00000000U)                                            /*!< configure ethernet MAC for connection with an MII PHY */
#define GPIO_ENET_PHY_RMII               AFIO_PCF0_ENET_PHY_SEL                                             /*!< configure ethernet MAC for connection with an RMII PHY */
#endif /* GD32E51X_CL||GD32E518 */

